-- TODO: 주문 번호가 1인 주문의 주문자 이름, 주소, 우편번호, 전화번호 조회


-- TODO : 주문 번호가 2인 주문의 주문일, 주문상태, 총금액, 주문고객 이름, 주문고객 이메일 주소 조회



-- TODO : 고객 ID가 120인 고객의 이름, 성별, 가입일과 지금까지 주문한 주문정보중 
--        주문_ID, 주문일, 총금액을 조회


-- TODO : 고객 ID가 110인 고객의 이름, 주소, 전화번호, 
--         그가 지금까지 주문한 주문정보중 주문_ID, 주문일, 주문상태 조회

 
-- TODO : 고객 ID가 120인 고객의 정보와 지금까지 주문한 주문정보를 모두 조회.


-- TODO : '2017/11/13'(주문날짜) 에 주문된 주문의 주문고객의 고객_ID, 이름, 
--        주문상태, 총금액을 조회


-- TODO : 주문상세 ID가 1인 주문제품의 제품이름, 판매가격, 제품가격을 조회.




-- TODO : 주문 ID가 4인 주문의 
-- 주문 고객의 이름, 주소, 우편번호,  => customers
-- 주문일, 주문상태, 총금액,         => orders
-- 주문 제품이름, 제조사, 제품가격,    => products
-- 판매가격, 제품수량을 조회.         => order_items



-- TODO : 제품 ID가 200인 제품이 2017년에 몇개 주문되었는지 조회.



-- TODO : 제품분류별 총 주문량을 조회







